---
kind: method
id: M:Autodesk.Revit.DB.DimensionSegmentArray.ForwardIterator
source: html/7175c6d7-bb41-f6f6-d7b3-fcd38435b868.htm
---
# Autodesk.Revit.DB.DimensionSegmentArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual DimensionSegmentArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.